# Pandas
As described at https://pandas.pydata.org 
> pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

## Resources
1. Ch 5-6 in Python for Data Analysis, 2nd Ed, Wes McKinney (UCalgary library and https://github.com/wesm/pydata-book)
2. Ch 3 in Python Data Science Handbook, Jake VanderPlas (Ucalgary library and https://github.com/jakevdp/PythonDataScienceHandbook)


Let's explore some of the features. 

First, import Pandas and NumPy

In [51]:
import numpy as np
import pandas as pd

## Create pandas DataFrames

There are several ways to create Pandas DataFrames, most notably from reading a csv (comma separated values file). DataFrames are 'spreadsheets' in Python. We will often use `df` as a variable name for a DataFrame.

If data is not stored in a file, a DataFrame can be created from a dictionary of lists

```python
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)


```

where dictionary keys become column headers.

An alternative is to create from a numpy array and set column headers separately:

In [52]:
# From a numpy array
df = pd.DataFrame( np.arange(20).reshape(5,4), columns=['alpha', 'beta', 'gamma', 'delta'])
df

   alpha  beta  gamma  delta
0      0     1      2      3
1      4     5      6      7
2      8     9     10     11
3     12    13     14     15
4     16    17     18     19

In [53]:
# checking its type
type(df)

pandas.core.frame.DataFrame

## Indexing
Accessing data in Dataframes is done by rows and columns, either index or label based.

In [54]:
# select a column
df['alpha']

0     0
1     4
2     8
3    12
4    16
Name: alpha, dtype: int32

In [55]:
# select two columns
df[['alpha', 'gamma']]

   alpha  gamma
0      0      2
1      4      6
2      8     10
3     12     14
4     16     18

In [56]:
# select rows
df.iloc[:2]

   alpha  beta  gamma  delta
0      0     1      2      3
1      4     5      6      7

In [57]:
# select rows and columns
df.iloc[:2, :2]

   alpha  beta
0      0     1
1      4     5

In [58]:
# select rows and columns, mixed
df.loc[:2, ['alpha', 'beta']]

   alpha  beta
0      0     1
1      4     5
2      8     9

## DataFrame math
Similar to Numpy, DataFrames support direct math

In [59]:
# direct math
df2 = (9/5) * df + 32
df2

   alpha  beta  gamma  delta
0   32.0  33.8   35.6   37.4
1   39.2  41.0   42.8   44.6
2   46.4  48.2   50.0   51.8
3   53.6  55.4   57.2   59.0
4   60.8  62.6   64.4   66.2

In [60]:
# add two dataframes of same shape
df + df2

   alpha  beta  gamma  delta
0   32.0  34.8   37.6   40.4
1   43.2  46.0   48.8   51.6
2   54.4  57.2   60.0   62.8
3   65.6  68.4   71.2   74.0
4   76.8  79.6   82.4   85.2

In [61]:
# map a function to each column
f = lambda x: x.max() - x.min()

df.apply(f)

alpha    16
beta     16
gamma    16
delta    16
dtype: int32

## DataFrame manipulation
Adding and deleting columns, as well as changing entries is similar to Python dictionaries.

Note that most DataFrame methods do not change the DataFrame directly, but return a new DataFrame. It is always good to check how the method you are invoking behaves.

In [62]:
# add a column
df['epsilon'] = ['low', 'medium', 'low', 'high', 'high']
df

   alpha  beta  gamma  delta epsilon
0      0     1      2      3     low
1      4     5      6      7  medium
2      8     9     10     11     low
3     12    13     14     15    high
4     16    17     18     19    high

In [63]:
# What is the size?
df.shape

(5, 5)

In [64]:
# delete column
df_dropped = df.drop(columns=['gamma'])
df_dropped

   alpha  beta  delta epsilon
0      0     1      3     low
1      4     5      7  medium
2      8     9     11     low
3     12    13     15    high
4     16    17     19    high

In [65]:
# the original dataframe is unaffected
df

   alpha  beta  gamma  delta epsilon
0      0     1      2      3     low
1      4     5      6      7  medium
2      8     9     10     11     low
3     12    13     14     15    high
4     16    17     18     19    high

Let's create a copy and assign new values to the first column:

In [66]:
df_copy = df.copy()
df_copy['alpha'] = 20
print(df)
print(df_copy)

   alpha  beta  gamma  delta epsilon
0      0     1      2      3     low
1      4     5      6      7  medium
2      8     9     10     11     low
3     12    13     14     15    high
4     16    17     18     19    high
   alpha  beta  gamma  delta epsilon
0     20     1      2      3     low
1     20     5      6      7  medium
2     20     9     10     11     low
3     20    13     14     15    high
4     20    17     18     19    high

DataFrames can be sorted by column:

In [67]:
# sorting values
df.sort_values(by='epsilon')

   alpha  beta  gamma  delta epsilon
3     12    13     14     15    high
4     16    17     18     19    high
0      0     1      2      3     low
2      8     9     10     11     low
1      4     5      6      7  medium

## Load data from file

Most often data will come from somewhere, often csv files, and using `pd.read_csv()` will allow smooth creation of DataFrames.

Let's load that same heart-attack.csv that we used in Numpy before:

In [69]:
data = pd.read_csv('heart-attack.csv')

After loading data, it is good practice to check what we have. Usually, the sequences is:
1. Check dimension
2. Peek at the first rows
3. Get info on data types and missing values
4. Summarize columns

In [70]:
# Check dimension (rows, columns) 
data.shape

(293, 14)

In [71]:
# Peek at the first rows
data.head()

,age,gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,28,1,2,130,132,0,2,185,0,0.0,?,?,?,0
1,29,1,2,120,243,0,0,160,0,0.0,?,?,?,0
2,29,1,2,140,?,0,0,170,0,0.0,?,?,?,0
3,30,0,1,170,237,0,1,170,0,0.0,?,?,6,0
4,31,0,2,100,219,0,1,150,0,0.0,?,?,?,0

In [72]:
# Column names are
data.columns

Index(['age', 'gender', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'num'],
      dtype='object')

In [73]:
# Get info on data types and missing values
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293 entries, 0 to 292
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       293 non-null    int64
 1   gender    293 non-null    int64
 2   cp        293 non-null    int64
 3   trestbps  293 non-null    object
 4   chol      293 non-null    object
 5   fbs       293 non-null    object
 6   restecg   293 non-null    object
 7   thalach   293 non-null    object
 8   exang     293 non-null    object
 9   oldpeak   293 non-null    float64
 10  slope     293 non-null    object
 11  ca        293 non-null    object
 12  thal      293 non-null    object
 13  num       293 non-null    int64
dtypes: float64(1), int64(4), object(9)
memory usage: 32.2+ KB

## Summarize values
How do we find the mean, std, min, max in each column?

In [74]:
data.mean()

TypeError: Could not convert ['13012014017010010511012512013015098120140120150120112130150120130130130130120130120140145110120120120130190120160110130130140130130140110125130120120125112115120120150120160140100120120120120150150142120120130150130180132140135120140130140120150110110180140130110160140?12012012010812015010013014011011011012413010014012014011012012014017014015016011013015012513013012014012513012014016014011314012012014012012413014012012012013014015016012011012012016016012015015011012213012014014511012012014013013013013012013018014013013014013513014013018014012013012516014012010014011012014011012092120110120150110118120140150106120160160115130140145160130125125140140130130100150140118110110150120130120130122160160160130120170120120130130140200140150150160130130120150130140135138130140135112130140160145180140140160145120150170136130140170140120140135120160128150140140140160130155180'
 '132243?237219198225254298161214220160167308264166340209160260211173283194223315275297292182?200204?241339147273307275289215281?250184245291295269250211196198268228147358223201215249266186?207218184215412237?297224?225224238275230163238240280257?249263276308?284195163254227?245238211??201207253187297?202328168216209129215194190220200188224179210?272180284100196259468216274?320195260182243221230273253309230312171208238246195305217?365344320394256196326277220270229219184?27685308347260230251179222188287318213?246294292193271270246156257267207196282117466289237247202186277193226263260268180265206288264303225216224201265213338248223306529?280392291219231222275193329355233182?246237242603?198268213255211263172175288290272248214341234160342298404246518285216295292248279230388164?264263?336288491205291212222231341266331294342393'
 '000000000000000000000000000?00000000010000000000000000000000000000000000001000000?0000000101000000000000000?00000000000000000000000?000000000100?000000000000001000000?000000100000000000000000000000?0?000000100000000000000100100000000100000000010001010000011000000000000100000011000000000000010'
 '2001100000101020000000110000001100000000000001001000100000000110000100000000000000111000001100010000000010000000010000000000000000100000010000011000000100011020000200100000100000000002110000000000000000000000000000000001110000000110010000000000000001010000000001001010?000111020000001001100100'
 '1851601701701501651841551851901681501851501801681801841781721301421849815016815812915013018014616014512010617016013214015017213816718814218015016017014414213715015513615214617014216517517611815417513811514213517017018014412211014014490165150116140140120135145150174125?14812012517511013010016011813816016016413517417213213014511016017011613514017012016012014515010014814013914011813816517012714213013216214011214815513814015015514013013013714215411013017513712213416015515013715015516013414011016410011412814098126140150110160100124150120100140135120115116152153150180140160130166170134152170138130150124125145981101151031561751701401501501201401221301451401301251158713015015013015513011511215010292991211501261161509112511814212812592921401301201501001751701081201401509611012482130120105136143961501241229912511911294118135135981589612214012513494100150110'
 '000000000000000000000000000000001000000000000000000000001000000000000000000000010010000001?0000010000000000000100001001000000010100010000100000000000000000000000000010001001000000010001100110001001101110111001000101100110100101000110111110111111111101011100111011110100110111011111011101111111'
 '?????????????????2?????????????12???????????????????????2???????????2?????????????2??12???1???1?2??????????2??2???????11??????2?????2????2??1?2????1???1???1?????????2???1?22?????2?2???2??122??22??22?22??222?222????22?222?22?2?2?2?2??32222?2??22?2222?222222?22222222?22?222222??2222?22?2222?222'
 '???????????????????????????????????????????????????????????????????????????????????????????????????????????????0??????????????????????????????????????????????????????????????????????0??????????????????????0???????????????????????????????????????????????????????????????????????????????????????'
 '???6?????????????3???????3???????????????????????????????????????3????????????????33????????????????6???????????3?????????7????????????????????????????????????77?????7??6???6??????3????????????????66???7??7??????7???????6??????66????????7???7??????????7?????????????????????????????6?????????7'] to numeric

In [75]:
# where are the other columns? Check data types
data.dtypes

age           int64
gender        int64
cp            int64
trestbps     object
chol         object
fbs          object
restecg      object
thalach      object
exang        object
oldpeak     float64
slope        object
ca           object
thal         object
num           int64
dtype: object

Notice that many columns are of type object, which is not a number. Maybe this has to do with missing values? We know from peeking at the first rows that there are '?' values in there. Let's replace these with the string NaN for not-a-number.

In [76]:
# replace '?' with 'NaN'
data = data.replace({'?': 'NaN'})
data.head()

,age,gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,28,1,2,130,132,0,2,185,0,0.0,NaN,NaN,NaN,0
1,29,1,2,120,243,0,0,160,0,0.0,NaN,NaN,NaN,0
2,29,1,2,140,NaN,0,0,170,0,0.0,NaN,NaN,NaN,0
3,30,0,1,170,237,0,1,170,0,0.0,NaN,NaN,6,0
4,31,0,2,100,219,0,1,150,0,0.0,NaN,NaN,NaN,0

Pandas knows that 'NaN' probably means that numbers are missing. Now we can convert the data type from object to float

In [77]:
# convert dtypes
data = data.astype('float')
data.dtypes

age         float64
gender      float64
cp          float64
trestbps    float64
chol        float64
fbs         float64
restecg     float64
thalach     float64
exang       float64
oldpeak     float64
slope       float64
ca          float64
thal        float64
num         float64
dtype: object

We could have loaded the data with the `na_values` argument to indicate that '?' means missing number:

In [78]:
data = pd.read_csv('heart-attack.csv', na_values='?')
data.dtypes

age           int64
gender        int64
cp            int64
trestbps    float64
chol        float64
fbs         float64
restecg     float64
thalach     float64
exang       float64
oldpeak     float64
slope       float64
ca          float64
thal        float64
num           int64
dtype: object

This worked nicely. Now we can describe all columns, meaning printing basic statistics. Note that by default Pandas ignores NaN, whereas Numpy does not.

In [79]:
data.describe() # ignores NaN

,age,gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
count,293.000000,293.000000,293.000000,292.000000,270.000000,285.000000,292.000000,292.000000,292.000000,293.000000,103.000000,3.0,28.000000,293.000000
mean,47.767918,0.723549,2.979522,132.592466,250.759259,0.070175,0.215753,139.212329,0.301370,0.584642,1.893204,0.0,5.642857,0.358362
std,7.760150,0.448007,0.964928,17.656176,67.767297,0.255892,0.459372,23.587727,0.459641,0.909879,0.340490,0.0,1.615074,0.480340
min,28.000000,0.000000,1.000000,92.000000,85.000000,0.000000,0.000000,82.000000,0.000000,0.000000,1.000000,0.0,3.000000,0.000000
25%,42.000000,0.000000,2.000000,120.000000,209.000000,0.000000,0.000000,122.000000,0.000000,0.000000,2.000000,0.0,5.250000,0.000000
50%,49.000000,1.000000,3.000000,130.000000,243.000000,0.000000,0.000000,140.000000,0.000000,0.000000,2.000000,0.0,6.000000,0.000000
75%,54.000000,1.000000,4.000000,140.000000,282.750000,0.000000,0.000000,155.000000,1.000000,1.000000,2.000000,0.0,7.000000,1.000000
max,66.000000,1.000000,4.000000,200.000000,603.000000,1.000000,2.000000,190.000000,1.000000,5.000000,3.000000,0.0,7.000000,1.000000

We could be interested in the statistics for each of the genders. To get these, we first group values by gender, then ask for the description. We will only look at age for clarity

In [80]:
data.groupby(by='gender').describe().age

        count       mean       std   min   25%   50%   75%   max
gender
0        81.0  47.654321  7.304383  30.0  43.0  48.0  53.0  62.0
1       212.0  47.811321  7.943656  28.0  41.0  49.0  54.0  66.0

## Find NaNs
How many NaNs in each column?

We can ask which entries are null, which produces a boolean array

In [81]:
data.isnull()

,age,gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,False,False,False,False,False,False,False,False,False,False,True,True,True,False
1,False,False,False,False,False,False,False,False,False,False,True,True,True,False
2,False,False,False,False,True,False,False,False,False,False,True,True,True,False
3,False,False,False,False,False,False,False,False,False,False,True,True,False,False
4,False,False,False,False,False,False,False,False,False,False,True,True,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
288,False,False,False,False,False,False,False,False,False,False,False,True,True,False
289,False,False,False,False,False,False,False,False,False,False,True,True,True,False
290,False,False,False,False,False,False,False,False,False,False,False,True,True,False
291,False,False,False,False,False,False,False,False,False,False,False,True,True,False
292,False,False,False,False,False,False,False,False,False,False,False,True,False,False

Applying `sum()` to this boolean array will count the number of `True` values in each column

In [82]:
data.isnull().sum()

age           0
gender        0
cp            0
trestbps      1
chol         23
fbs           8
restecg       1
thalach       1
exang         1
oldpeak       0
slope       190
ca          290
thal        265
num           0
dtype: int64

We get complementary information from `info()`

In [83]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293 entries, 0 to 292
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       293 non-null    int64
 1   gender    293 non-null    int64
 2   cp        293 non-null    int64
 3   trestbps  292 non-null    float64
 4   chol      270 non-null    float64
 5   fbs       285 non-null    float64
 6   restecg   292 non-null    float64
 7   thalach   292 non-null    float64
 8   exang     292 non-null    float64
 9   oldpeak   293 non-null    float64
 10  slope     103 non-null    float64
 11  ca        3 non-null      float64
 12  thal      28 non-null     float64
 13  num       293 non-null    int64
dtypes: float64(10), int64(4)
memory usage: 32.2 KB

We can fill (replace) these missing values, for example with the minimum value in each column

In [84]:
data.fillna(data.min()).describe()

,age,gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
count,293.000000,293.000000,293.000000,293.000000,293.000000,293.000000,293.000000,293.000000,293.000000,293.000000,293.000000,293.0,293.000000,293.000000
mean,47.767918,0.723549,2.979522,132.453925,237.747440,0.068259,0.215017,139.017065,0.300341,0.584642,1.313993,0.0,3.252560,0.358362
std,7.760150,0.448007,0.964928,17.784731,78.898698,0.252622,0.458758,23.783334,0.459191,0.909879,0.472217,0.0,0.920301,0.480340
min,28.000000,0.000000,1.000000,92.000000,85.000000,0.000000,0.000000,82.000000,0.000000,0.000000,1.000000,0.0,3.000000,0.000000
25%,42.000000,0.000000,2.000000,120.000000,198.000000,0.000000,0.000000,122.000000,0.000000,0.000000,1.000000,0.0,3.000000,0.000000
50%,49.000000,1.000000,3.000000,130.000000,237.000000,0.000000,0.000000,140.000000,0.000000,0.000000,1.000000,0.0,3.000000,0.000000
75%,54.000000,1.000000,4.000000,140.000000,277.000000,0.000000,0.000000,155.000000,1.000000,1.000000,2.000000,0.0,3.000000,1.000000
max,66.000000,1.000000,4.000000,200.000000,603.000000,1.000000,2.000000,190.000000,1.000000,5.000000,3.000000,0.0,7.000000,1.000000

## Count unique values (a histogram)

We finish off, with our good friend the histogram

In [85]:
data['age'].value_counts()

age
54    25
48    19
52    17
55    15
49    15
46    13
53    12
50    12
43    12
39    11
41    11
47    10
56    10
58     9
51     9
59     8
45     8
37     8
42     7
40     7
38     7
44     7
36     5
35     5
57     5
34     4
32     4
65     2
61     2
60     2
62     2
31     2
33     2
29     2
63     1
28     1
30     1
66     1
Name: count, dtype: int64

## Missing column names

What if our dataset is missing column names?

Let's practice loading data again with the wine dataset from https://archive.ics.uci.edu/ml/datasets/wine:

In [88]:
data = pd.read_csv('wine.data')
data.head()

,1,14.23,1.71,2.43,15.6,127,2.8,3.06,.28,2.29,5.64,1.04,3.92,1065
0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
1,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
2,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
3,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735
4,1,14.20,1.76,2.45,15.2,112,3.27,3.39,0.34,1.97,6.75,1.05,2.85,1450

With pandas, the program assumes that the first row of values holds the column names. If there are no column names, as seen in this example, the first row of data is used for the column names. To fix this, we can use `header=None` inside the read_csv function. We can also manually set the column names:

In [89]:
data = pd.read_csv('wine.data',
                  header=None,
                  names=["class",
                         "alcohol",
                         "malic_acid",
                         "ash",
                         "alcalinity",
                         "magnesium",
                         "total_phenols",
                         "flavanoids", 
                         "nonflavanoid_phenols",
                         "proanthocyanins",
                         "color_intensity",
                         "hue",
                         "OD280_OD315",
                         "proline" ])
data.head()

,class,alcohol,malic_acid,ash,alcalinity,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,OD280_OD315,proline
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

For practice, you can repeat the steps above for the wine dataset:

In [90]:
# Check dimension (rows, columns)
data.shape

(178, 14)

In [91]:
# Peek at the first rows
data.head()

,class,alcohol,malic_acid,ash,alcalinity,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,OD280_OD315,proline
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [92]:
# Print column names
data.columns

Index(['class', 'alcohol', 'malic_acid', 'ash', 'alcalinity', 'magnesium',
       'total_phenols', 'flavanoids', 'nonflavanoid_phenols',
       'proanthocyanins', 'color_intensity', 'hue', 'OD280_OD315', 'proline'],
      dtype='object')

In [93]:
# Get info on data types and missing values
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   class                 178 non-null    int64
 1   alcohol               178 non-null    float64
 2   malic_acid            178 non-null    float64
 3   ash                   178 non-null    float64
 4   alcalinity            178 non-null    float64
 5   magnesium             178 non-null    int64
 6   total_phenols         178 non-null    float64
 7   flavanoids            178 non-null    float64
 8   nonflavanoid_phenols  178 non-null    float64
 9   proanthocyanins       178 non-null    float64
 10  color_intensity       178 non-null    float64
 11  hue                   178 non-null    float64
 12  OD280_OD315           178 non-null    float64
 13  proline               178 non-null    int64
dtypes: float64(11), int64(3)
memory usage: 19.6 KB

## Summarize values
What is the mean, std, min, max in each column?

In [96]:
# mean
data.mean()

class                     1.938202
alcohol                  13.000618
malic_acid                2.336348
ash                       2.366517
alcalinity               19.494944
magnesium                99.741573
total_phenols             2.295112
flavanoids                2.029270
nonflavanoid_phenols      0.361854
proanthocyanins           1.590899
color_intensity           5.058090
hue                       0.957449
OD280_OD315               2.611685
proline                 746.893258
dtype: float64

In [97]:
# std
data.std()

class                     0.775035
alcohol                   0.811827
malic_acid                1.117146
ash                       0.274344
alcalinity                3.339564
magnesium                14.282484
total_phenols             0.625851
flavanoids                0.998859
nonflavanoid_phenols      0.124453
proanthocyanins           0.572359
color_intensity           2.318286
hue                       0.228572
OD280_OD315               0.709990
proline                 314.907474
dtype: float64

In [98]:
# min
data.min()

class                     1.00
alcohol                  11.03
malic_acid                0.74
ash                       1.36
alcalinity               10.60
magnesium                70.00
total_phenols             0.98
flavanoids                0.34
nonflavanoid_phenols      0.13
proanthocyanins           0.41
color_intensity           1.28
hue                       0.48
OD280_OD315               1.27
proline                 278.00
dtype: float64

In [99]:
# max
data.max()

class                      3.00
alcohol                   14.83
malic_acid                 5.80
ash                        3.23
alcalinity                30.00
magnesium                162.00
total_phenols              3.88
flavanoids                 5.08
nonflavanoid_phenols       0.66
proanthocyanins            3.58
color_intensity           13.00
hue                        1.71
OD280_OD315                4.00
proline                 1680.00
dtype: float64

We could be interested in the statistics for each of the classes. To get these, we first group values by class, then ask for the description. We will only look at alcohol for simplicity.

In [100]:
# We could be interested in the stats for each of the classes. To get these, we first group values by class then ask for the description. We will only look at alcohol for simplicity.
data.groupby(by='class').describe().alcohol

       count       mean       std    min     25%     50%     75%    max
class
1       59.0  13.744746  0.462125  12.85  13.400  13.750  14.100  14.83
2       71.0  12.278732  0.537964  11.03  11.915  12.290  12.515  13.86
3       48.0  13.153750  0.530241  12.20  12.805  13.165  13.505  14.34

## Find NaNs
How many NaNs in each column?

We can ask which entries are null, which produces a boolean array

In [106]:
# How many NaN values are there? We can ask which entries are null, which produces a boolean array.
data.isnull()

,class,alcohol,malic_acid,ash,alcalinity,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,OD280_OD315,proline
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,False,False,False,False,False,False,False,False,False,False,False,False,False,False
174,False,False,False,False,False,False,False,False,False,False,False,False,False,False
175,False,False,False,False,False,False,False,False,False,False,False,False,False,False
176,False,False,False,False,False,False,False,False,False,False,False,False,False,False
177,False,False,False,False,False,False,False,False,False,False,False,False,False,False

Applying `sum()` to this boolean array will count the number of `True` values in each column

In [103]:
data.isnull().sum()

class                   0
alcohol                 0
malic_acid              0
ash                     0
alcalinity              0
magnesium               0
total_phenols           0
flavanoids              0
nonflavanoid_phenols    0
proanthocyanins         0
color_intensity         0
hue                     0
OD280_OD315             0
proline                 0
dtype: int64

We get complementary information from `info()`

In [107]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   class                 178 non-null    int64
 1   alcohol               178 non-null    float64
 2   malic_acid            178 non-null    float64
 3   ash                   178 non-null    float64
 4   alcalinity            178 non-null    float64
 5   magnesium             178 non-null    int64
 6   total_phenols         178 non-null    float64
 7   flavanoids            178 non-null    float64
 8   nonflavanoid_phenols  178 non-null    float64
 9   proanthocyanins       178 non-null    float64
 10  color_intensity       178 non-null    float64
 11  hue                   178 non-null    float64
 12  OD280_OD315           178 non-null    float64
 13  proline               178 non-null    int64
dtypes: float64(11), int64(3)
memory usage: 19.6 KB

## Count unique values (a histogram)

We finish off, with our good friend the histogram

In [109]:
data['alcohol'].value_counts()

alcohol
13.05    6
12.37    6
12.08    5
12.29    4
12.42    3
        ..
13.72    1
13.29    1
13.74    1
13.77    1
14.13    1
Name: count, Length: 126, dtype: int64